jantielens/esp32-template-wifi/src/app/image_api.cpp
/*
 * Image API Implementation
 * 
 * REST API handlers for uploading and displaying JPEG images.
 * Uses backend adapter pattern for portability across projects.
 */

#include "board_config.h"

#if HAS_IMAGE_API

#include "image_api.h"
#include "jpeg_preflight.h"
#include "log_manager.h"
#include "device_telemetry.h"

#if HAS_DISPLAY
#include "display_manager.h"
#endif

#include <Arduino.h>
#include <ESPAsyncWebServer.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>
#include <string.h>

#include "lvgl_jpeg_decoder.h"

#include <esp_heap_caps.h>
#include <soc/soc_caps.h>

static void* image_api_alloc(size_t size) {
    if (size == 0) return nullptr;

#if SOC_SPIRAM_SUPPORTED
    // Prefer PSRAM to reduce internal heap pressure when available.
    void* p = heap_caps_malloc(size, MALLOC_CAP_SPIRAM);
    if (p) return p;
#endif

    // Fallback: any 8-bit heap.
    // On some no-PSRAM boards, using INTERNAL|8BIT can exclude viable 8-bit regions.
    // Using 8BIT matches ESP.getFreeHeap() behavior and can reduce pressure on the
    // internal heap reserved for decode-time allocations.
    return heap_caps_malloc(size, MALLOC_CAP_8BIT);
}

static void image_api_free(void* p) {
    if (!p) return;
    heap_caps_free(p);
}

static size_t image_api_no_psram_effective_headroom_bytes(size_t base_headroom, size_t free_heap, size_t largest_block) {
    // On no-PSRAM boards, a fixed headroom is often either too strict (false rejects) or too lax.
    // Use a simple fragmentation-based adaptation:
    // - When fragmentation is low (largest block is a good fraction of free heap), allow a smaller headroom.
    // - When fragmentation is higher, fall back to the configured headroom.
    // Keep a minimum safety floor.
    const size_t min_headroom = 24 * 1024;
    size_t headroom = base_headroom;

    size_t frag_pct = 100;
    if (free_heap > 0 && largest_block <= free_heap) {
        frag_pct = 100 - (largest_block * 100) / free_heap;
    }

    if (frag_pct <= 45) {
        headroom = min(headroom, (size_t)(32 * 1024));
    } else if (frag_pct <= 60) {
        headroom = min(headroom, (size_t)(40 * 1024));
    }

    headroom = max(headroom, min_headroom);
    return headroom;
}

// ===== Constants =====

// Note: AsyncWebServer callbacks run on the AsyncTCP task. Do not block
// (e.g., with delay()/busy waits). If we're busy, return 409 and let the
// client retry.

// ===== Internal state =====

static ImageApiConfig g_cfg;
static ImageApiBackend g_backend = {nullptr, nullptr, nullptr};

// Image upload buffer (allocated temporarily during upload)
static uint8_t* image_upload_buffer = nullptr;
static size_t image_upload_size = 0;
static unsigned long image_upload_timeout_ms = 10000;

// Upload state tracking
enum UploadState {
    UPLOAD_IDLE = 0,
    UPLOAD_IN_PROGRESS,
    UPLOAD_READY_TO_DISPLAY
};
static volatile UploadState upload_state = UPLOAD_IDLE;
static volatile unsigned long pending_op_id = 0;  // Incremented when new op is queued

// Pending image display operation (processed by main loop)
struct PendingImageOp {
    uint8_t* buffer;
    size_t size;
    bool dismiss;  // true = dismiss current image, false = show new image
    unsigned long timeout_ms;  // Display timeout in milliseconds
    unsigned long start_time;  // Time when upload completed (for accurate timeout)
};
static PendingImageOp pending_image_op = {nullptr, 0, false, 10000, 0};

// Strip upload state (buffering during HTTP upload)
static uint8_t* current_strip_buffer = nullptr;
static size_t current_strip_size = 0;

// Strip processing state (async decode queue)
struct PendingStripOp {
    uint8_t* buffer;
    size_t size;
    uint8_t strip_index;
    int image_width;
    int image_height;
    int total_strips;
    unsigned long timeout_ms;
    unsigned long start_time;
};
static PendingStripOp pending_strip_op = {nullptr, 0, 0, 0, 0, 0, 10000, 0};

// URL download state (queued by HTTP handler, executed in main loop)
static constexpr size_t IMAGE_API_URL_MAX_LEN = 256;
struct PendingUrlOp {
    bool active;
    char url[IMAGE_API_URL_MAX_LEN];
    unsigned long timeout_ms;
};
static PendingUrlOp pending_url_op = {false, {0}, 0};

// Small body buffer for /api/display/image_url to avoid heap allocation.
// AsyncWebServer body callbacks can be interrupted by client disconnects; keeping this static
// prevents leaks. We also add a timeout so a stalled upload doesn't block future requests.
static bool image_url_body_in_use = false;
static size_t image_url_body_expected_len = 0;
static unsigned long image_url_body_start_ms = 0;
static char image_url_body_buf[1024 + 1];

// Track partial uploads so we can reclaim memory if the client disconnects mid-transfer.
static unsigned long image_upload_start_ms = 0;
static unsigned long strip_upload_last_activity_ms = 0;

static bool is_jpeg_magic(const uint8_t* buf, size_t sz) {
    return (buf && sz >= 3 && buf[0] == 0xFF && buf[1] == 0xD8 && buf[2] == 0xFF);
}

static unsigned long parse_timeout_ms(AsyncWebServerRequest* request) {
    // Parse optional timeout parameter from query string (e.g., ?timeout=30)
    unsigned long timeout_seconds = g_cfg.default_timeout_ms / 1000;
    if (request->hasParam("timeout")) {
        String timeout_str = request->getParam("timeout")->value();
        timeout_seconds = (unsigned long)timeout_str.toInt();
        // Clamp to prevent overflow and respect max timeout
        unsigned long max_seconds = g_cfg.max_timeout_ms / 1000;
        if (timeout_seconds > max_seconds) timeout_seconds = max_seconds;
    }
    return timeout_seconds * 1000UL;
}

static bool starts_with_ignore_case(const char* s, const char* prefix) {
    if (!s || !prefix) return false;
    while (*prefix) {
        const char a = *s;
        const char b = *prefix;
        if (!a) return false;
        const char al = (a >= 'A' && a <= 'Z') ? (char)(a - 'A' + 'a') : a;
        const char bl = (b >= 'A' && b <= 'Z') ? (char)(b - 'A' + 'a') : b;
        if (al != bl) return false;
        s++;
        prefix++;
    }
    return true;
}

enum UrlScheme {
    URL_SCHEME_HTTP = 0,
    URL_SCHEME_HTTPS = 1,
};

// Minimal URL parser: http(s)://host[:port]/path
static bool parse_http_or_https_url(
    const char* url,
    UrlScheme* scheme_out,
    char* host_out,
    size_t host_out_len,
    uint16_t* port_out,
    char* path_out,
    size_t path_out_len
) {
    if (!url || !scheme_out || !host_out || !port_out || !path_out) return false;

