jantielens/esp32-template-wifi/src/app/image_api.cpp
    // Parse headers
    bool chunked = false;
    size_t content_length = 0;
    {
        const char* p = strstr(header, "\r\n");
        if (!p) {
            snprintf(err, err_len, "Invalid HTTP headers");
            return false;
        }
        p += 2;
        while (*p) {
            const char* next = strstr(p, "\r\n");
            if (!next) break;
            if (next == p) break; // end of headers

            const size_t line_len = (size_t)(next - p);
            if (line_len > 0) {
                if (starts_with_ignore_case(p, "Content-Length:")) {
                    const char* v = p + strlen("Content-Length:");
                    while (*v == ' ' || *v == '\t') v++;
                    content_length = (size_t)strtoul(v, nullptr, 10);
                } else if (starts_with_ignore_case(p, "Transfer-Encoding:")) {
                    // If chunked, we bail for now (keeps implementation small + memory-predictable).
                    if (strstr(p, "chunked") || strstr(p, "Chunked") || strstr(p, "CHUNKED")) {
                        chunked = true;
                    }
                }
            }
            p = next + 2;
        }
    }
    if (chunked) {
        snprintf(err, err_len, "Chunked transfer unsupported");
        return false;
    }
    if (content_length == 0) {
        snprintf(err, err_len, "Missing Content-Length");
        return false;
    }
    if (content_length > g_cfg.max_image_size_bytes) {
        snprintf(err, err_len, "Image too large (%u bytes)", (unsigned)content_length);
        return false;
    }

    uint8_t* buf = (uint8_t*)image_api_alloc(content_length);
    if (!buf) {
        snprintf(err, err_len, "Out of memory allocating %u bytes", (unsigned)content_length);
        return false;
    }

    size_t pos = 0;
    while (pos < content_length && !timed_out()) {
        const int r = client->read(buf + pos, (int)min((size_t)1024, content_length - pos));
        if (r > 0) {
            pos += (size_t)r;
            continue;
        }
        delay(1);
    }

    if (pos != content_length) {
        image_api_free(buf);
        snprintf(err, err_len, "Incomplete body (%u/%u)", (unsigned)pos, (unsigned)content_length);
        return false;
    }

    if (!is_jpeg_magic(buf, content_length)) {
        image_api_free(buf);
        snprintf(err, err_len, "Downloaded data is not a JPEG");
        return false;
    }

    *out_buf = buf;
    *out_sz = content_length;
    return true;
}

// ===== Handlers =====

// POST /api/display/image - Upload and display JPEG image (deferred decode)
static void handleImageUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    (void)filename;

    // First chunk - initialize upload
    if (index == 0) {
        // If upload already in progress OR pending display, reject (client can retry)
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY) {
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Upload busy\"}");
            return;
        }

        Logger.logBegin("Image Upload");
        Logger.logLinef("Total size: %u bytes", request->contentLength());

        image_upload_timeout_ms = parse_timeout_ms(request);
        image_upload_start_ms = millis();
        Logger.logLinef("Timeout: %lu ms", image_upload_timeout_ms);

        device_telemetry_log_memory_snapshot("img pre-clear");

        // Free any pending image buffer to make room for new upload
        if (pending_image_op.buffer) {
            Logger.logMessage("Upload", "Freeing pending image buffer");
            image_api_free((void*)pending_image_op.buffer);
            pending_image_op.buffer = nullptr;
            pending_image_op.size = 0;
        }

        device_telemetry_log_memory_snapshot("img post-clear");

        // Check file size
        size_t total_size = request->contentLength();
        if (total_size > g_cfg.max_image_size_bytes) {
            Logger.logEnd("ERROR: Image too large");
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Image too large\"}");
            return;
        }

        // Check memory availability.
        // - Upload uses a single contiguous buffer.
        // - The decode pipeline needs headroom (historically expressed via g_cfg.decode_headroom_bytes).

#if SOC_SPIRAM_SUPPORTED
        // `SOC_SPIRAM_SUPPORTED` means the SoC can use PSRAM, but some boards have no PSRAM fitted.
        // Use a runtime check so no-PSRAM boards don't take PSRAM-specific headroom gating.
        const bool has_psram = psramFound();
        const size_t psram_free = has_psram ? heap_caps_get_free_size(MALLOC_CAP_SPIRAM) : 0;
        const size_t psram_largest = has_psram ? heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM) : 0;
        const bool psram_can_hold_upload = has_psram && (psram_free >= total_size) && (psram_largest >= total_size);
#else
        const size_t psram_free = 0;
        const size_t psram_largest = 0;
        const bool psram_can_hold_upload = false;
#endif

        // PSRAM boards vs no-PSRAM boards behave very differently.
        // - On PSRAM boards: upload buffer is expected to land in PSRAM; keep an internal headroom guard.
        // - On no-PSRAM boards: keep the historical "total heap" guard (ESP.getFreeHeap) so we don't
        //   falsely reject when internal-only metrics look tight but the system can still operate.
#if SOC_SPIRAM_SUPPORTED
        if (has_psram) {
            const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
            if (internal_free < g_cfg.decode_headroom_bytes) {
            Logger.logLinef(
                "ERROR: Insufficient internal memory for decode headroom (need %u, have %u)",
                (unsigned)g_cfg.decode_headroom_bytes,
                (unsigned)internal_free
            );
            device_telemetry_log_memory_snapshot("img insufficient");
            char error_msg[240];
            snprintf(
                error_msg,
                sizeof(error_msg),
                "{\"success\":false,\"message\":\"Insufficient internal memory: need %uKB decode headroom, have %uKB.\"}",
                (unsigned)(g_cfg.decode_headroom_bytes / 1024),
                (unsigned)(internal_free / 1024)
            );
            Logger.logEnd();
            request->send(507, "application/json", error_msg);
            return;
            }

