jantielens/esp32-template-wifi/src/app/image_api.cpp
            pending_image_op.buffer = image_upload_buffer;
            pending_image_op.size = image_upload_size;
            pending_image_op.dismiss = false;
            pending_image_op.timeout_ms = image_upload_timeout_ms;
            pending_image_op.start_time = millis();
            pending_op_id++;
            upload_state = UPLOAD_READY_TO_DISPLAY;

            // main loop owns the buffer now
            image_upload_buffer = nullptr;
            image_upload_size = 0;

            Logger.logEnd("Image queued for display");

            char response_msg[160];
            snprintf(response_msg, sizeof(response_msg),
                     "{\"success\":true,\"message\":\"Image queued for display (%lus timeout)\"}",
                     (unsigned long)(image_upload_timeout_ms / 1000));
            request->send(200, "application/json", response_msg);
        } else {
            Logger.logEnd("ERROR: No data received");
            upload_state = UPLOAD_IDLE;
            request->send(400, "application/json", "{\"success\":false,\"message\":\"No data received\"}");
        }
    }
}

// DELETE /api/display/image - Manually dismiss image
static void handleImageDelete(AsyncWebServerRequest *request) {
    Logger.logMessage("Portal", "Image dismiss requested");

    if (pending_image_op.buffer) {
        image_api_free((void*)pending_image_op.buffer);
    }
    pending_image_op.buffer = nullptr;
    pending_image_op.size = 0;
    pending_image_op.dismiss = true;
    upload_state = UPLOAD_READY_TO_DISPLAY;
    pending_op_id++;

    request->send(200, "application/json", "{\"success\":true,\"message\":\"Image dismiss queued\"}");
}

// POST /api/display/image_url - Queue HTTP(S) JPEG download for display
// Body: {"url":"https://example.com/image.jpg"}
static void handleImageUrl(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
    // Only accept small JSON payloads.
    if (index == 0) {
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY || pending_url_op.active || pending_strip_op.buffer) {
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Busy\"}");
            return;
        }
        if (total == 0 || total > 1024) {
            request->send(413, "application/json", "{\"success\":false,\"message\":\"Body too large\"}");
            return;
        }
        // If a previous request stalled (e.g., disconnect mid-body), reclaim after a short timeout.
        if (image_url_body_in_use) {
            const unsigned long elapsed = (unsigned long)(millis() - image_url_body_start_ms);
            if (elapsed > 3000UL) {
                image_url_body_in_use = false;
                image_url_body_expected_len = 0;
                image_url_body_buf[0] = '\0';
            } else {
                request->send(409, "application/json", "{\"success\":false,\"message\":\"Busy\"}");
                return;
            }
        }

        image_url_body_in_use = true;
        image_url_body_expected_len = total;
        image_url_body_start_ms = millis();
        image_url_body_buf[0] = '\0';
    }

    if (!image_url_body_in_use || total == 0 || total != image_url_body_expected_len) {
        request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid body state\"}");
        return;
    }

    if (index + len > sizeof(image_url_body_buf) - 1) {
        image_url_body_in_use = false;
        image_url_body_expected_len = 0;
        request->send(413, "application/json", "{\"success\":false,\"message\":\"Body too large\"}");
        return;
    }

    memcpy(image_url_body_buf + index, data, len);
    if (index + len >= total) {
        image_url_body_buf[total] = '\0';

        StaticJsonDocument<512> doc;
        const DeserializationError jerr = deserializeJson(doc, image_url_body_buf);
        image_url_body_in_use = false;
        image_url_body_expected_len = 0;

        if (jerr) {
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid JSON\"}");
            return;
        }

        const char* url = doc["url"] | "";
        if (!url || strlen(url) == 0) {
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Missing url\"}");
            return;
        }
        if (strlen(url) >= IMAGE_API_URL_MAX_LEN) {
            request->send(400, "application/json", "{\"success\":false,\"message\":\"URL too long\"}");
            return;
        }

        // Free any pending image buffer to make room.
        if (pending_image_op.buffer) {
            image_api_free((void*)pending_image_op.buffer);
            pending_image_op.buffer = nullptr;
            pending_image_op.size = 0;
        }

        // Publish the URL op atomically-ish: fill fields first, then flip `active` last.
        // The AsyncTCP task writes these, while the main loop reads them.
        strncpy(pending_url_op.url, url, sizeof(pending_url_op.url));
        pending_url_op.url[sizeof(pending_url_op.url) - 1] = '\0';
        pending_url_op.timeout_ms = parse_timeout_ms(request);
        pending_url_op.active = true;

        upload_state = UPLOAD_READY_TO_DISPLAY;
        pending_op_id++;

        request->send(200, "application/json", "{\"success\":true,\"message\":\"Image URL queued\"}");
    }
}

// POST /api/display/image/strips?strip_index=N&strip_count=T&width=W&height=H[&timeout=seconds]
// Upload a single JPEG strip; decode is deferred to the main loop.
static void handleStripUpload(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
    // Validate required params
    if (index == 0) {
        const bool has_required =
            request->hasParam("strip_index", false) &&
            request->hasParam("strip_count", false) &&
            request->hasParam("width", false) &&
            request->hasParam("height", false);

        if (!has_required) {
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Missing required parameters: strip_index, strip_count, width, height\"}");
            return;
        }
    }

    if (!request->hasParam("strip_index", false) || !request->hasParam("strip_count", false) ||
        !request->hasParam("width", false) || !request->hasParam("height", false)) {
        request->send(400, "application/json", "{\"success\":false,\"message\":\"Missing required parameters: strip_index, strip_count, width, height\"}");
        return;
    }

    const int stripIndex = request->getParam("strip_index", false)->value().toInt();
    const int totalStrips = request->getParam("strip_count", false)->value().toInt();
    const int imageWidth = request->getParam("width", false)->value().toInt();
    const int imageHeight = request->getParam("height", false)->value().toInt();
    const unsigned long timeoutMs = request->hasParam("timeout", false)
        ? (unsigned long)request->getParam("timeout", false)->value().toInt() * 1000UL
        : g_cfg.default_timeout_ms;

    if (index == 0) {
        // Reject if we're busy. AsyncWebServer runs on AsyncTCP task; do not block.
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY || pending_strip_op.buffer) {
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Busy\"}");
            return;
        }

