jantielens/esp32-template-wifi/src/app/image_api.cpp
        // Only log first strip to reduce verbosity
        if (stripIndex == 0) {
            Logger.logMessagef("Strip Mode", "Uploading %dx%d image (%d strips)", imageWidth, imageHeight, totalStrips);
            device_telemetry_log_memory_snapshot("strip pre-alloc");
        }

        if (stripIndex < 0 || stripIndex >= totalStrips) {
            Logger.logEnd("ERROR: Invalid strip index");
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid strip index\"}");
            return;
        }

        if (imageWidth <= 0 || imageHeight <= 0 || imageWidth > g_cfg.lcd_width || imageHeight > g_cfg.lcd_height) {
            Logger.logLinef("ERROR: Invalid dimensions %dx%d", imageWidth, imageHeight);
            Logger.logEnd();
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid image dimensions\"}");
            return;
        }

        if (current_strip_buffer) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
        }

        current_strip_buffer = (uint8_t*)image_api_alloc(total);
        if (!current_strip_buffer) {
            Logger.logLinef("ERROR: Out of memory (requested %u bytes, free heap: %u)", (unsigned)total, ESP.getFreeHeap());
            device_telemetry_log_memory_snapshot("strip alloc-fail");
            Logger.logEnd();
            request->send(507, "application/json", "{\"success\":false,\"message\":\"Out of memory\"}");
            return;
        }

        current_strip_size = 0;
        strip_upload_last_activity_ms = millis();
    }

    if (current_strip_buffer && current_strip_size + len <= total) {
        memcpy((uint8_t*)current_strip_buffer + current_strip_size, data, len);
        current_strip_size += len;
        strip_upload_last_activity_ms = millis();
    }

    // Final chunk: decode synchronously before returning
    if (index + len >= total) {
        if (current_strip_size != total) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();
            request->send(500, "application/json", "{\"success\":false,\"message\":\"Incomplete upload\"}");
            return;
        }

        if (!is_jpeg_magic(current_strip_buffer, current_strip_size)) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid JPEG data\"}");
            return;
        }

        // Best-effort header preflight
        char preflight_err[160];
        const int remaining_height = imageHeight;
        if (!jpeg_preflight_tjpgd_fragment_supported(
                current_strip_buffer,
                current_strip_size,
                imageWidth,
                remaining_height,
                g_cfg.lcd_height,
                preflight_err,
                sizeof(preflight_err))) {
            Logger.logLinef("ERROR: JPEG fragment preflight failed: %s", preflight_err);
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();

            char resp[256];
            snprintf(resp, sizeof(resp), "{\"success\":false,\"message\":\"%s\"}", preflight_err);
            request->send(400, "application/json", resp);
            return;
        }

        // Queue strip for async decode (don't decode in HTTP handler)
        // If we're busy, reject and let client retry.
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY || pending_strip_op.buffer) {
            image_api_free((void*)current_strip_buffer);
            current_strip_buffer = nullptr;
            Logger.logEnd();
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Busy\"}" );
            return;
        }

        // Transfer strip buffer to pending operation
        upload_state = UPLOAD_IN_PROGRESS;
        pending_strip_op.buffer = current_strip_buffer;
        pending_strip_op.size = current_strip_size;
        pending_strip_op.strip_index = (uint8_t)stripIndex;
        pending_strip_op.image_width = imageWidth;
        pending_strip_op.image_height = imageHeight;
        pending_strip_op.total_strips = totalStrips;
        pending_strip_op.timeout_ms = timeoutMs;
        pending_strip_op.start_time = millis();
        
        current_strip_buffer = nullptr;
        current_strip_size = 0;
        
        upload_state = UPLOAD_READY_TO_DISPLAY;
        pending_op_id++;
        
        Logger.logMessagef("Strip", "Strip %d/%d queued for decode", stripIndex, totalStrips - 1);
        Logger.logEnd();

        char response[160];
        snprintf(response, sizeof(response),
                 "{\"success\":true,\"strip_index\":%d,\"strip_count\":%d,\"complete\":%s}",
                 stripIndex, totalStrips, (stripIndex == totalStrips - 1) ? "true" : "false");
        request->send(200, "application/json", response);
    }
}

// ===== Public API =====

void image_api_init(const ImageApiConfig& cfg, const ImageApiBackend& backend) {
    g_cfg = cfg;
    g_backend = backend;

    image_upload_timeout_ms = g_cfg.default_timeout_ms;

    // Best-effort: reset state
    upload_state = UPLOAD_IDLE;
    pending_op_id = 0;
    pending_image_op = {nullptr, 0, false, g_cfg.default_timeout_ms, 0};

    if (current_strip_buffer) {
        image_api_free((void*)current_strip_buffer);
        current_strip_buffer = nullptr;
    }
    current_strip_size = 0;

    if (pending_strip_op.buffer) {
        image_api_free((void*)pending_strip_op.buffer);
        pending_strip_op.buffer = nullptr;
    }
    pending_strip_op = {nullptr, 0, 0, 0, 0, 0, g_cfg.default_timeout_ms, 0};

    if (image_upload_buffer) {
        image_api_free((void*)image_upload_buffer);
        image_upload_buffer = nullptr;
    }
    image_upload_size = 0;
}

void image_api_register_routes(AsyncWebServer* server) {
    // Register the more specific /strips endpoint before /image.
    server->on(
        "/api/display/image/strips",
        HTTP_POST,
        [](AsyncWebServerRequest *request) {},
        NULL,
        handleStripUpload
    );

    server->on(
        "/api/display/image",
        HTTP_POST,
        [](AsyncWebServerRequest *request) {},
        handleImageUpload
    );

    server->on(
        "/api/display/image_url",
        HTTP_POST,
        [](AsyncWebServerRequest *request) {},
        NULL,
        handleImageUrl
    );

    server->on("/api/display/image", HTTP_DELETE, handleImageDelete);
}

void image_api_process_pending(bool ota_in_progress) {
    static unsigned long last_processed_id = 0;

    // Reclaim memory from interrupted uploads.
    // AsyncWebServer may stop calling the upload handlers if the client disconnects mid-transfer.
    if (upload_state == UPLOAD_IN_PROGRESS && !ota_in_progress) {
        // Full-image multipart upload stuck.
        if (image_upload_buffer && image_upload_timeout_ms > 0) {
            const unsigned long elapsed = (unsigned long)(millis() - image_upload_start_ms);
            // Give the client a little extra beyond the configured display timeout.
            if (elapsed > (image_upload_timeout_ms + 3000UL)) {
                Logger.logMessage("ImageApi", "WARNING: Aborting stuck image upload; freeing buffer");
                image_api_free((void*)image_upload_buffer);
                image_upload_buffer = nullptr;
                image_upload_size = 0;
                upload_state = UPLOAD_IDLE;
            }
        }

        // Strip upload stuck.
        if (current_strip_buffer) {
            const unsigned long elapsed = (unsigned long)(millis() - strip_upload_last_activity_ms);
            if (elapsed > 3000UL) {
                Logger.logMessage("ImageApi", "WARNING: Aborting stuck strip upload; freeing buffer");
                image_api_free((void*)current_strip_buffer);
                current_strip_buffer = nullptr;
                current_strip_size = 0;
                upload_state = UPLOAD_IDLE;
            }
        }
    }

    if (upload_state != UPLOAD_READY_TO_DISPLAY || ota_in_progress) {
        return;
    }

    if (pending_op_id == last_processed_id) {
        return;
    }

