jantielens/esp32-template-wifi/src/app/image_api.cpp
    last_processed_id = pending_op_id;

    // Handle queued HTTP(S) download
    if (pending_url_op.active) {
        Logger.logMessagef("Portal", "Downloading image URL (%s)", pending_url_op.url);
        device_telemetry_log_memory_snapshot("urlimg pre-download");

        upload_state = UPLOAD_IN_PROGRESS;

        const unsigned long timeout_ms = pending_url_op.timeout_ms;

        uint8_t* downloaded = nullptr;
        size_t downloaded_sz = 0;
        char err[128];
        const bool ok = download_jpeg_to_buffer(pending_url_op.url, timeout_ms, &downloaded, &downloaded_sz, err, sizeof(err));

        pending_url_op.active = false;
        pending_url_op.url[0] = '\0';

        device_telemetry_log_memory_snapshot("urlimg post-download");

        if (!ok) {
            Logger.logMessagef("Portal", "ERROR: URL download failed: %s", err);
            device_telemetry_log_memory_snapshot("urlimg download-fail");
            upload_state = UPLOAD_IDLE;
            if (g_backend.hide_current_image) {
                g_backend.hide_current_image();
            }
            return;
        }

        // Queue the downloaded JPEG for decode on the next main-loop tick.
        if (pending_image_op.buffer) {
            image_api_free((void*)pending_image_op.buffer);
        }
        pending_image_op.buffer = downloaded;
        pending_image_op.size = downloaded_sz;
        pending_image_op.dismiss = false;
        pending_image_op.timeout_ms = timeout_ms > 0 ? timeout_ms : g_cfg.default_timeout_ms;
        pending_image_op.start_time = millis();
        pending_op_id++;
        upload_state = UPLOAD_READY_TO_DISPLAY;
        return;
    }

    // Handle dismiss operation
    if (pending_image_op.dismiss) {
        device_telemetry_log_memory_snapshot("img dismiss");
        if (g_backend.hide_current_image) {
            g_backend.hide_current_image();
        }
        pending_image_op.dismiss = false;
        upload_state = UPLOAD_IDLE;
        return;
    }

    // Handle strip operation
    if (pending_strip_op.buffer && pending_strip_op.size > 0) {
        const uint8_t* buf = pending_strip_op.buffer;
        const size_t sz = pending_strip_op.size;
        const uint8_t strip_index = pending_strip_op.strip_index;
        const int total_strips = pending_strip_op.total_strips;

        Logger.logMessagef("Portal", "Processing strip %d/%d (%u bytes)", strip_index, total_strips - 1, (unsigned)sz);

        if (strip_index == 0) {
            device_telemetry_log_memory_snapshot("strip pre-decode");
        }

        // Initialize strip session on first strip
        if (strip_index == 0) {
            if (!g_backend.start_strip_session) {
                Logger.logMessage("Portal", "ERROR: No strip session handler");
                if (g_backend.hide_current_image) {
                    g_backend.hide_current_image();
                }
                image_api_free((void*)pending_strip_op.buffer);
                pending_strip_op.buffer = nullptr;
                upload_state = UPLOAD_IDLE;
                return;
            }

            if (!g_backend.start_strip_session(pending_strip_op.image_width, pending_strip_op.image_height, 
                                                pending_strip_op.timeout_ms, pending_strip_op.start_time)) {
                Logger.logMessage("Portal", "ERROR: Failed to init strip session");
                if (g_backend.hide_current_image) {
                    g_backend.hide_current_image();
                }
                image_api_free((void*)pending_strip_op.buffer);
                pending_strip_op.buffer = nullptr;
                upload_state = UPLOAD_IDLE;
                return;
            }
        }

        // Decode strip
        bool success = false;
        if (g_backend.decode_strip) {
            #if HAS_DISPLAY
            // Serialize with LVGL task to protect buffered backends (Arduino_GFX canvas)
            // and prevent overlapping present()/SPI polling transactions.
            display_manager_lock();
            #endif
            success = g_backend.decode_strip(buf, sz, strip_index, false);
            #if HAS_DISPLAY
            display_manager_unlock();
            #endif
        }

        if (strip_index == (uint8_t)(total_strips - 1)) {
            device_telemetry_log_memory_snapshot("strip post-decode");
        }

        image_api_free((void*)pending_strip_op.buffer);
        pending_strip_op.buffer = nullptr;
        pending_strip_op.size = 0;
        upload_state = UPLOAD_IDLE;

        if (!success) {
            Logger.logMessagef("Portal", "ERROR: Failed to decode strip %d", strip_index);
            device_telemetry_log_memory_snapshot("strip decode-fail");
            if (g_backend.hide_current_image) {
                g_backend.hide_current_image();
            }
        } else if (strip_index == total_strips - 1) {
            Logger.logMessagef("Portal", "\u2713 All %d strips decoded", total_strips);
        }
        return;
    }

    // Handle full image operation (fallback for full mode)
    if (pending_image_op.buffer && pending_image_op.size > 0) {
        const uint8_t* buf = pending_image_op.buffer;
        const size_t sz = pending_image_op.size;

        Logger.logMessagef("Portal", "Processing pending image (%u bytes)", (unsigned)sz);

        device_telemetry_log_memory_snapshot("img pre-decode");

        #if HAS_DISPLAY && LV_USE_IMG
        // PoC: if the user is currently on the LVGL image screen, decode JPEG to RGB565 and
        // show via LVGL (lv_img) instead of direct LCD writes.
        const char* current_screen = display_manager_get_current_screen_id();
        Logger.logMessagef("Portal", "Current screen: %s", current_screen ? current_screen : "(none)");
        if (current_screen && strcmp(current_screen, "lvgl_image") == 0) {
            uint16_t* pixels = nullptr;
            int w = 0;
            int h = 0;
            int scale_used = -1;
            char derr[96];

